Xml-integration-demo/HotelRQ/20210611103354966HotelSearch.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><hot:Credentials Password="Sra@12896022" UserName="WESARA"/><wsa:Action>http://TekTravel/HotelBookingApi/HotelSearch</wsa:Action><wsa:To>https://api.tboholidays.com/HotelApi_V7/HotelService.svc</wsa:To></env:Header><env:Body><HotelSearchRequest xmlns="http://TekTravel/HotelBookingApi"><CheckInDate>2021-06-11T00:00:00.000Z</CheckInDate><CheckOutDate>2021-06-12T00:00:00.000Z</CheckOutDate><CityId>0</CityId><IsNearBySearchAllowed>false</IsNearBySearchAllowed><NoOfRooms>0</NoOfRooms><ResultCount>0</ResultCount><ResponseTime>0</ResponseTime></HotelSearchRequest></env:Body></env:Envelope>